---

C#Visual BasicVisual C++

Revit 2024 API
---
Face..::..Evaluate Method
Face Class See Also Send Feedback
---

Evaluates and returns the XYZ coordinates of a point at the indicated UV parameterization of the face.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public XYZ Evaluate(
    	UV params
    )

Visual Basic
---

    Public Function Evaluate ( _
    	params As UV _
    ) As XYZ

Visual C++
---

    public:
    XYZ^ Evaluate(
    	UV^ params
    )

#### Parameters

params
    Type: Autodesk.Revit.DB..::..UVThe parameters to be evaluated, in natural parameterization of the face.

#### Return Value

The XYZ coordinates.

# Remarks

The evaluation is performed on the underlying Surface, and can return results outside of the boundaries of the face.

# See Also

Face Class

Autodesk.Revit.DB Namespace